package јбстрактные лассыћетоды;


/*
 * јЅ—“–ј “Ќџ≈  Ћј——џ » ћ≈“ќƒџ
 * 
 * классы Dog, Cow, Pig, Animalferm(абстрактный), Ferm
 * абстрактные классы и методы нужны дл€ предоставлени€ функционала другим классам
 * все абстрактные методы абстрактного класса должны быть в реальных классах
 * экземпл€р абстрактного класса и абстрактный метод нельз€ вызвать
 * абстрактный метод можно создать только в абстрактном классе
 * в абстрактном классе необ€зательно каждый метод должен быть абстрактным
 * 
 */

abstract public class Animalsferm {
	abstract void animal();
}
      