package AbstractClassesMethods;


/*
 * АБСТРАКТНЫЕ КЛАССЫ И МЕТОДЫ
 * 
 * классы Dog, Cow, Pig, Animalferm(абстрактный), Ferm
 * абстрактные классы и методы нужны для предоставления функционала другим классам
 * все абстрактные методы абстрактного класса должны быть в реальных классах
 * экземпляр абстрактного класса и абстрактный метод нельзя вызвать
 * абстрактный метод можно создать только в абстрактном классе
 * в абстрактном классе необязательно каждый метод должен быть абстрактным
 * 
 */

abstract public class Animalsferm {
	abstract void animal();
}    